# GetFilesInFolder

## Description
Returns the Nth filename in a folder.

```pascal
FUNCTION GetFilesInFolder(
				folderName : DYNARRAY[] of CHAR;
				index      : LONGINT) : DYNARRAY[] of CHAR;
```

```python

def vs.GetFilesInFolder(folderName, index):
    return DYNARRAY[] of CHAR
```

## Parameters
|Name|Type|Description|
|---|---|---|
|folderName|DYNARRAY[] of CHAR||
|index|LONGINT||

## Version
Availability: from Vectorworks 2014
## Category
* File I/O